#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_realm.this: Refreshing state... [id=Tian_Dev_Test]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group.admin: Refreshing state... [id=a12e0da8-9287-499b-940d-79e0b5538184]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group.viewer: Refreshing state... [id=fade75d0-c881-4906-9df9-46735c77956c]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.admin_role_mappings: Refreshing state... [id=Tian_Dev_Test/a12e0da8-9287-499b-940d-79e0b5538184]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-clients"]: Refreshing state... [id=Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-events"]: Refreshing state... [id=Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-realm"]: Refreshing state... [id=Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-users"]: Refreshing state... [id=Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-identity-providers"]: Refreshing state... [id=Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c]
module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-authorization"]: Refreshing state... [id=Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group.admin has changed
  ~ resource "keycloak_group" "admin" {
      + attributes = {}
        id         = "a12e0da8-9287-499b-940d-79e0b5538184"
        name       = "Realm Administrator"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group.viewer has changed
  ~ resource "keycloak_group" "viewer" {
      + attributes = {}
        id         = "fade75d0-c881-4906-9df9-46735c77956c"
        name       = "Realm Viewer"
        # (2 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-authorization"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          + "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          + "68fab769-db5f-4d2d-925e-6b551867aa8c",
          + "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          + "cce473e4-1da1-4381-9147-440d4ad437be",
          + "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-clients"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          + "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          + "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          + "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          + "cce473e4-1da1-4381-9147-440d4ad437be",
          + "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-events"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          + "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          + "68fab769-db5f-4d2d-925e-6b551867aa8c",
          + "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          + "cce473e4-1da1-4381-9147-440d4ad437be",
          + "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-identity-providers"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          + "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          + "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          + "68fab769-db5f-4d2d-925e-6b551867aa8c",
          + "cce473e4-1da1-4381-9147-440d4ad437be",
          + "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-realm"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          + "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          + "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          + "68fab769-db5f-4d2d-925e-6b551867aa8c",
          + "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          + "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-users"] has changed
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          + "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          + "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          + "68fab769-db5f-4d2d-925e-6b551867aa8c",
          + "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          + "cce473e4-1da1-4381-9147-440d4ad437be",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_realm.this has changed
  ~ resource "keycloak_realm" "this" {
      + attributes                               = {}
      + default_default_client_scopes            = []
      + default_optional_client_scopes           = []
        id                                       = "Tian_Dev_Test"
        # (39 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_openid_client.management_client will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "management_client"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.admin_role will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "admin_role"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.viewer_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.viewer_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.viewer_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.viewer_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.viewer_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.data.keycloak_role.viewer_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "viewer_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group.admin will be created
  + resource "keycloak_group" "admin" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group.viewer will be created
  + resource "keycloak_group" "viewer" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.admin_role_mappings will be created
  + resource "keycloak_group_roles" "admin_role_mappings" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.viewer_roles["view-authorization"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.viewer_roles["view-clients"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.viewer_roles["view-events"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.viewer_roles["view-identity-providers"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.viewer_roles["view-realm"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_group_roles.viewer_roles["view-users"] will be created
  + resource "keycloak_group_roles" "viewer_roles" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_clients.module.jon-new-realm.keycloak_realm.this will be created
  + resource "keycloak_realm" "this" {
      + access_code_lifespan                     = (known after apply)
      + access_code_lifespan_login               = (known after apply)
      + access_code_lifespan_user_action         = (known after apply)
      + access_token_lifespan                    = (known after apply)
      + access_token_lifespan_for_implicit_flow  = (known after apply)
      + action_token_generated_by_admin_lifespan = (known after apply)
      + action_token_generated_by_user_lifespan  = (known after apply)
      + browser_flow                             = (known after apply)
      + client_authentication_flow               = (known after apply)
      + client_session_idle_timeout              = (known after apply)
      + client_session_max_lifespan              = (known after apply)
      + direct_grant_flow                        = (known after apply)
      + docker_authentication_flow               = (known after apply)
      + duplicate_emails_allowed                 = (known after apply)
      + edit_username_allowed                    = (known after apply)
      + enabled                                  = true
      + id                                       = (known after apply)
      + internal_id                              = (known after apply)
      + login_with_email_allowed                 = (known after apply)
      + oauth2_device_code_lifespan              = (known after apply)
      + oauth2_device_polling_interval           = (known after apply)
      + offline_session_idle_timeout             = (known after apply)
      + offline_session_max_lifespan             = (known after apply)
      + offline_session_max_lifespan_enabled     = false
      + realm                                    = "jon-awesome-new-realm"
      + refresh_token_max_reuse                  = 0
      + registration_allowed                     = (known after apply)
      + registration_email_as_username           = (known after apply)
      + registration_flow                        = (known after apply)
      + remember_me                              = (known after apply)
      + reset_credentials_flow                   = (known after apply)
      + reset_password_allowed                   = (known after apply)
      + revoke_refresh_token                     = false
      + ssl_required                             = "external"
      + sso_session_idle_timeout                 = (known after apply)
      + sso_session_idle_timeout_remember_me     = (known after apply)
      + sso_session_max_lifespan                 = (known after apply)
      + sso_session_max_lifespan_remember_me     = (known after apply)
      + user_managed_access                      = false
      + verify_email                             = (known after apply)

      + otp_policy {
          + algorithm         = (known after apply)
          + digits            = (known after apply)
          + initial_counter   = (known after apply)
          + look_ahead_window = (known after apply)
          + period            = (known after apply)
          + type              = (known after apply)
        }

      + web_authn_passwordless_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }

      + web_authn_policy {
          + acceptable_aaguids                = (known after apply)
          + attestation_conveyance_preference = (known after apply)
          + authenticator_attachment          = (known after apply)
          + avoid_same_authenticator_register = (known after apply)
          + create_timeout                    = (known after apply)
          + relying_party_entity_name         = (known after apply)
          + relying_party_id                  = (known after apply)
          + require_resident_key              = (known after apply)
          + signature_algorithms              = (known after apply)
          + user_verification_requirement     = (known after apply)
        }
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-authorization"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          - "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          - "68fab769-db5f-4d2d-925e-6b551867aa8c",
          - "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          - "cce473e4-1da1-4381-9147-440d4ad437be",
          - "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-clients"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          - "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          - "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          - "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          - "cce473e4-1da1-4381-9147-440d4ad437be",
          - "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-events"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          - "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          - "68fab769-db5f-4d2d-925e-6b551867aa8c",
          - "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          - "cce473e4-1da1-4381-9147-440d4ad437be",
          - "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-identity-providers"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          - "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          - "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          - "68fab769-db5f-4d2d-925e-6b551867aa8c",
          - "cce473e4-1da1-4381-9147-440d4ad437be",
          - "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-realm"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          - "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          - "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          - "68fab769-db5f-4d2d-925e-6b551867aa8c",
          - "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          - "f58c463f-eb82-4cb7-a5c9-5c7ec5bb96bb",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

  # module.keycloak_dev.module.custom_clients.module.new-realm.keycloak_group_roles.viewer_roles["view-users"] will be updated in-place
  ~ resource "keycloak_group_roles" "viewer_roles" {
        id         = "Tian_Dev_Test/fade75d0-c881-4906-9df9-46735c77956c"
      ~ role_ids   = [
          - "54f5ebe6-e8b7-429a-843f-cea2d9bb6384",
          - "6169ba94-a755-48b8-b2fd-57bdbea29b86",
          - "68fab769-db5f-4d2d-925e-6b551867aa8c",
          - "a1018d4b-d29c-4d0d-9583-65422edbb95c",
          - "cce473e4-1da1-4381-9147-440d4ad437be",
            # (1 unchanged element hidden)
        ]
        # (3 unchanged attributes hidden)
    }

Plan: 10 to add, 6 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @thegentlemanphysicist, Action: `pull_request`*